hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_risaf.h
/*
; stm32N657_risaf.
; ================

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		stm32N657_risaf equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

// RISAF address definitions
// -------------------------

typedef struct {
	volatile	uint32_t	CR;
	volatile	uint32_t	RESERVED0;
	volatile	uint32_t	IASR;
	volatile	uint32_t	IACR;
	volatile	uint32_t	RESERVED1[4];
	volatile	uint32_t	IAESR;
	volatile	uint32_t	IADDR;
	volatile	uint32_t	RESERVED2[6];
	volatile	uint32_t	REG1_CFGR;
	volatile	uint32_t	REG1_STARTR;
	volatile	uint32_t	REG1_ENDR;
	volatile	uint32_t	REG1_CIDCFGR;
	volatile	uint32_t	REG1_ACFGR;
	volatile	uint32_t	REG1_ASTARTR;
	volatile	uint32_t	REG1_AENDR;
	volatile	uint32_t	REG1_ANESTR;
	volatile	uint32_t	REG1_BCFGR;
	volatile	uint32_t	REG1_BSTARTR;
	volatile	uint32_t	REG1_BENDR;
	volatile	uint32_t	REG1_BNESTR;
	volatile	uint32_t	RESERVED3[4];
	volatile	uint32_t	REG2_CFGR;
	volatile	uint32_t	REG2_STARTR;
	volatile	uint32_t	REG2_ENDR;
	volatile	uint32_t	REG2_CIDCFGR;
	volatile	uint32_t	REG2_ACFGR;
	volatile	uint32_t	REG2_ASTARTR;
	volatile	uint32_t	REG2_AENDR;
	volatile	uint32_t	REG2_ANESTR;
	volatile	uint32_t	REG2_BCFGR;
	volatile	uint32_t	REG2_BSTARTR;
	volatile	uint32_t	REG2_BENDR;
	volatile	uint32_t	REG2_BNESTR;
	volatile	uint32_t	RESERVED4[4];
	volatile	uint32_t	REG3_CFGR;
	volatile	uint32_t	REG3_STARTR;
	volatile	uint32_t	REG3_ENDR;
	volatile	uint32_t	REG3_CIDCFGR;
	volatile	uint32_t	REG3_ACFGR;
	volatile	uint32_t	REG3_ASTARTR;
	volatile	uint32_t	REG3_AENDR;
	volatile	uint32_t	REG3_ANESTR;
	volatile	uint32_t	REG3_BCFGR;
	volatile	uint32_t	REG3_BSTARTR;
	volatile	uint32_t	REG3_BENDR;
	volatile	uint32_t	REG3_BNESTR;
	volatile	uint32_t	RESERVED5[4];
	volatile	uint32_t	REG4_CFGR;
	volatile	uint32_t	REG4_STARTR;
	volatile	uint32_t	REG4_ENDR;
	volatile	uint32_t	REG4_CIDCFGR;
	volatile	uint32_t	REG4_ACFGR;
	volatile	uint32_t	REG4_ASTARTR;
	volatile	uint32_t	REG4_AENDR;
	volatile	uint32_t	REG4_ANESTR;
	volatile	uint32_t	REG4_BCFGR;
	volatile	uint32_t	REG4_BSTARTR;
	volatile	uint32_t	REG4_BENDR;
	volatile	uint32_t	REG4_BNESTR;
	volatile	uint32_t	RESERVED6[4];
	volatile	uint32_t	REG5_CFGR;
	volatile	uint32_t	REG5_STARTR;
	volatile	uint32_t	REG5_ENDR;
	volatile	uint32_t	REG5_CIDCFGR;
	volatile	uint32_t	REG5_ACFGR;
	volatile	uint32_t	REG5_ASTARTR;
	volatile	uint32_t	REG5_AENDR;
	volatile	uint32_t	REG5_ANESTR;
	volatile	uint32_t	REG5_BCFGR;
	volatile	uint32_t	REG5_BSTARTR;
	volatile	uint32_t	REG5_BENDR;
	volatile	uint32_t	REG5_BNESTR;
	volatile	uint32_t	RESERVED7[4];
	volatile	uint32_t	REG6_CFGR;
	volatile	uint32_t	REG6_STARTR;
	volatile	uint32_t	REG6_ENDR;
	volatile	uint32_t	REG6_CIDCFGR;
	volatile	uint32_t	REG6_ACFGR;
	volatile	uint32_t	REG6_ASTARTR;
	volatile	uint32_t	REG6_AENDR;
	volatile	uint32_t	REG6_ANESTR;
	volatile	uint32_t	REG6_BCFGR;
	volatile	uint32_t	REG6_BSTARTR;
	volatile	uint32_t	REG6_BENDR;
	volatile	uint32_t	REG6_BNESTR;
	volatile	uint32_t	RESERVED8[4];
	volatile	uint32_t	REG7_CFGR;
	volatile	uint32_t	REG7_STARTR;
	volatile	uint32_t	REG7_ENDR;
	volatile	uint32_t	REG7_CIDCFGR;
	volatile	uint32_t	REG7_ACFGR;
	volatile	uint32_t	REG7_ASTARTR;
	volatile	uint32_t	REG7_AENDR;
	volatile	uint32_t	REG7_ANESTR;
	volatile	uint32_t	REG7_BCFGR;
	volatile	uint32_t	REG7_BSTARTR;
	volatile	uint32_t	REG7_BENDR;
	volatile	uint32_t	REG7_BNESTR;
	volatile	uint32_t	RESERVED9[4];
	volatile	uint32_t	REG8_CFGR;
	volatile	uint32_t	REG8_STARTR;
	volatile	uint32_t	REG8_ENDR;
	volatile	uint32_t	REG8_CIDCFGR;
	volatile	uint32_t	REG8_ACFGR;
	volatile	uint32_t	REG8_ASTARTR;
	volatile	uint32_t	REG8_AENDR;
	volatile	uint32_t	REG8_ANESTR;
	volatile	uint32_t	REG8_BCFGR;
	volatile	uint32_t	REG8_BSTARTR;
	volatile	uint32_t	REG8_BENDR;
	volatile	uint32_t	REG8_BNESTR;
	volatile	uint32_t	RESERVED10[4];
	volatile	uint32_t	REG9_CFGR;
	volatile	uint32_t	REG9_STARTR;
	volatile	uint32_t	REG9_ENDR;
	volatile	uint32_t	REG9_CIDCFGR;
	volatile	uint32_t	REG9_ACFGR;
	volatile	uint32_t	REG9_ASTARTR;
	volatile	uint32_t	REG9_AENDR;
	volatile	uint32_t	REG9_ANESTR;
	volatile	uint32_t	REG9_BCFGR;
	volatile	uint32_t	REG9_BSTARTR;
	volatile	uint32_t	REG9_BENDR;
	volatile	uint32_t	REG9_BNESTR;
	volatile	uint32_t	RESERVED11[4];
	volatile	uint32_t	REG10_CFGR;
	volatile	uint32_t	REG10_STARTR;
	volatile	uint32_t	REG10_ENDR;
	volatile	uint32_t	REG10_CIDCFGR;
	volatile	uint32_t	REG10_ACFGR;
	volatile	uint32_t	REG10_ASTARTR;
	volatile	uint32_t	REG10_AENDR;
	volatile	uint32_t	REG10_ANESTR;
	volatile	uint32_t	REG10_BCFGR;
	volatile	uint32_t	REG10_BSTARTR;
	volatile	uint32_t	REG10_BENDR;
	volatile	uint32_t	REG10_BNESTR;
	volatile	uint32_t	RESERVED12[4];
	volatile	uint32_t	REG11_CFGR;
	volatile	uint32_t	REG11_STARTR;
	volatile	uint32_t	REG11_ENDR;
	volatile	uint32_t	REG11_CIDCFGR;
	volatile	uint32_t	REG11_ACFGR;
	volatile	uint32_t	REG11_ASTARTR;
	volatile	uint32_t	REG11_AENDR;
	volatile	uint32_t	REG11_ANESTR;
	volatile	uint32_t	REG11_BCFGR;
	volatile	uint32_t	REG11_BSTARTR;
	volatile	uint32_t	REG11_BENDR;
	volatile	uint32_t	REG11_BNESTR;
	volatile	uint32_t	RESERVED13[4];
	volatile	uint32_t	REG12_CFGR;
	volatile	uint32_t	REG12_STARTR;
	volatile	uint32_t	REG12_ENDR;
	volatile	uint32_t	REG12_CIDCFGR;
	volatile	uint32_t	REG12_ACFGR;
	volatile	uint32_t	REG12_ASTARTR;
	volatile	uint32_t	REG12_AENDR;
	volatile	uint32_t	REG12_ANESTR;
	volatile	uint32_t	REG12_BCFGR;
	volatile	uint32_t	REG12_BSTARTR;
	volatile	uint32_t	REG12_BENDR;
	volatile	uint32_t	REG12_BNESTR;
	volatile	uint32_t	RESERVED14[4];
	volatile	uint32_t	REG13_CFGR;
	volatile	uint32_t	REG13_STARTR;
	volatile	uint32_t	REG13_ENDR;
	volatile	uint32_t	REG13_CIDCFGR;
	volatile	uint32_t	REG13_ACFGR;
	volatile	uint32_t	REG13_ASTARTR;
	volatile	uint32_t	REG13_AENDR;
	volatile	uint32_t	REG13_ANESTR;
	volatile	uint32_t	REG13_BCFGR;
	volatile	uint32_t	REG13_BSTARTR;
	volatile	uint32_t	REG13_BENDR;
	volatile	uint32_t	REG13_BNESTR;
	volatile	uint32_t	RESERVED15[4];
	volatile	uint32_t	REG14_CFGR;
	volatile	uint32_t	REG14_STARTR;
	volatile	uint32_t	REG14_ENDR;
	volatile	uint32_t	REG14_CIDCFGR;
	volatile	uint32_t	REG14_ACFGR;
	volatile	uint32_t	REG14_ASTARTR;
	volatile	uint32_t	REG14_AENDR;
	volatile	uint32_t	REG14_ANESTR;
	volatile	uint32_t	REG14_BCFGR;
	volatile	uint32_t	REG14_BSTARTR;
	volatile	uint32_t	REG14_BENDR;
	volatile	uint32_t	REG14_BNESTR;
	volatile	uint32_t	RESERVED16[4];
	volatile	uint32_t	REG15_CFGR;
	volatile	uint32_t	REG15_STARTR;
	volatile	uint32_t	REG15_ENDR;
	volatile	uint32_t	REG15_CIDCFGR;
	volatile	uint32_t	REG15_ACFGR;
	volatile	uint32_t	REG15_ASTARTR;
	volatile	uint32_t	REG15_AENDR;
	volatile	uint32_t	REG15_ANESTR;
	volatile	uint32_t	REG15_BCFGR;
	volatile	uint32_t	REG15_BSTARTR;
	volatile	uint32_t	REG15_BENDR;
	volatile	uint32_t	REG15_BNESTR;
} RISAF_TypeDef;

#if (defined(__cplusplus))
#define	RISAF_NS	reinterpret_cast<RISAF_TypeDef *>(0x44026000u)
#define	RISAF_S		reinterpret_cast<RISAF_TypeDef *>(0x54026000u)

#else
#define	RISAF_NS	((RISAF_TypeDef *)0x44026000u)
#define	RISAF_S		((RISAF_TypeDef *)0x54026000u)
#endif

