hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_risaf.h
// REG8_ASTARTR Configuration

#define	RISAF_REG8_ASTARTR_SADDSTART		(0xFFFFFFFFu<<0)
#define	RISAF_REG8_ASTARTR_SADDSTART_0		(0x1u<<0)

// REG8_AENDR Configuration

#define	RISAF_REG8_AENDR_SADDEND			(0xFFFFFFFFu<<0)
#define	RISAF_REG8_AENDR_SADDEND_0			(0x1u<<0)

// REG8_ANESTR Configuration

#define	RISAF_REG8_ANESTR_DCEN				(0x1u<<2)

#define	RISAF_REG8_ANESTR_DCEN_B_0X0		(0x0u<<2)
#define	RISAF_REG8_ANESTR_DCEN_B_0X1		(0x1u<<2)

// REG8_BCFGR Configuration

#define	RISAF_REG8_BCFGR_WREN				(0x1u<<13)
#define	RISAF_REG8_BCFGR_RDEN				(0x1u<<12)
#define	RISAF_REG8_BCFGR_PRIV				(0x1u<<9)
#define	RISAF_REG8_BCFGR_SEC				(0x1u<<8)
#define	RISAF_REG8_BCFGR_SRCID				(0x7u<<4)
#define	RISAF_REG8_BCFGR_SRCID_0			(0x1u<<4)
#define	RISAF_REG8_BCFGR_RLOCK				(0x1u<<1)
#define	RISAF_REG8_BCFGR_SREN				(0x1u<<0)

#define	RISAF_REG8_BCFGR_WREN_B_0X0			(0x0u<<13)
#define	RISAF_REG8_BCFGR_WREN_B_0X1			(0x1u<<13)
#define	RISAF_REG8_BCFGR_RDEN_B_0X0			(0x0u<<12)
#define	RISAF_REG8_BCFGR_RDEN_B_0X1			(0x1u<<12)
#define	RISAF_REG8_BCFGR_PRIV_B_0X0			(0x0u<<9)
#define	RISAF_REG8_BCFGR_PRIV_B_0X1			(0x1u<<9)
#define	RISAF_REG8_BCFGR_SEC_B_0X0			(0x0u<<8)
#define	RISAF_REG8_BCFGR_SEC_B_0X1			(0x1u<<8)
#define	RISAF_REG8_BCFGR_RLOCK_B_0X0		(0x0u<<1)
#define	RISAF_REG8_BCFGR_RLOCK_B_0X1		(0x1u<<1)
#define	RISAF_REG8_BCFGR_SREN_B_0X0			(0x0u<<0)
#define	RISAF_REG8_BCFGR_SREN_B_0X1			(0x1u<<0)

// REG8_BSTARTR Configuration

#define	RISAF_REG8_BSTARTR_SADDSTART		(0xFFFFFFFFu<<0)
#define	RISAF_REG8_BSTARTR_SADDSTART_0		(0x1u<<0)

// REG8_BENDR Configuration

#define	RISAF_REG8_BENDR_SADDEND			(0xFFFFFFFFu<<0)
#define	RISAF_REG8_BENDR_SADDEND_0			(0x1u<<0)

// REG8_BNESTR Configuration

#define	RISAF_REG8_BNESTR_DCEN				(0x1u<<2)

#define	RISAF_REG8_BNESTR_DCEN_B_0X0		(0x0u<<2)
#define	RISAF_REG8_BNESTR_DCEN_B_0X1		(0x1u<<2)

// REG9_CFGR Configuration

#define	RISAF_REG9_CFGR_PRIVC7				(0x1u<<23)
#define	RISAF_REG9_CFGR_PRIVC6				(0x1u<<22)
#define	RISAF_REG9_CFGR_PRIVC5				(0x1u<<21)
#define	RISAF_REG9_CFGR_PRIVC4				(0x1u<<20)
#define	RISAF_REG9_CFGR_PRIVC3				(0x1u<<19)
#define	RISAF_REG9_CFGR_PRIVC2				(0x1u<<18)
#define	RISAF_REG9_CFGR_PRIVC1				(0x1u<<17)
#define	RISAF_REG9_CFGR_PRIVC0				(0x1u<<16)
#define	RISAF_REG9_CFGR_SEC					(0x1u<<8)
#define	RISAF_REG9_CFGR_BREN				(0x1u<<0)

#define	RISAF_REG9_CFGR_PRIVC7_B_0X0		(0x0u<<23)
#define	RISAF_REG9_CFGR_PRIVC7_B_0X1		(0x1u<<23)
#define	RISAF_REG9_CFGR_PRIVC6_B_0X0		(0x0u<<22)
#define	RISAF_REG9_CFGR_PRIVC6_B_0X1		(0x1u<<22)
#define	RISAF_REG9_CFGR_PRIVC5_B_0X0		(0x0u<<21)
#define	RISAF_REG9_CFGR_PRIVC5_B_0X1		(0x1u<<21)
#define	RISAF_REG9_CFGR_PRIVC4_B_0X0		(0x0u<<20)
#define	RISAF_REG9_CFGR_PRIVC4_B_0X1		(0x1u<<20)
#define	RISAF_REG9_CFGR_PRIVC3_B_0X0		(0x0u<<19)
#define	RISAF_REG9_CFGR_PRIVC3_B_0X1		(0x1u<<19)
#define	RISAF_REG9_CFGR_PRIVC2_B_0X0		(0x0u<<18)
#define	RISAF_REG9_CFGR_PRIVC2_B_0X1		(0x1u<<18)
#define	RISAF_REG9_CFGR_PRIVC1_B_0X0		(0x0u<<17)
#define	RISAF_REG9_CFGR_PRIVC1_B_0X1		(0x1u<<17)
#define	RISAF_REG9_CFGR_PRIVC0_B_0X0		(0x0u<<16)
#define	RISAF_REG9_CFGR_PRIVC0_B_0X1		(0x1u<<16)
#define	RISAF_REG9_CFGR_SEC_B_0X0			(0x0u<<8)
#define	RISAF_REG9_CFGR_SEC_B_0X1			(0x1u<<8)
#define	RISAF_REG9_CFGR_BREN_B_0X0			(0x0u<<0)
#define	RISAF_REG9_CFGR_BREN_B_0X1			(0x1u<<0)

// REG9_STARTR Configuration

#define	RISAF_REG9_STARTR_BADDSTART			(0xFFFFFFFFu<<0)
#define	RISAF_REG9_STARTR_BADDSTART_0		(0x1u<<0)

// REG9_ENDR Configuration

#define	RISAF_REG9_ENDR_BADDEND				(0xFFFFFFFFu<<0)
#define	RISAF_REG9_ENDR_BADDEND_0			(0x1u<<0)

// REG9_CIDCFGR Configuration

#define	RISAF_REG9_CIDCFGR_WRENC7			(0x1u<<23)
#define	RISAF_REG9_CIDCFGR_WRENC6			(0x1u<<22)
#define	RISAF_REG9_CIDCFGR_WRENC5			(0x1u<<21)
#define	RISAF_REG9_CIDCFGR_WRENC4			(0x1u<<20)
#define	RISAF_REG9_CIDCFGR_WRENC3			(0x1u<<19)
#define	RISAF_REG9_CIDCFGR_WRENC2			(0x1u<<18)
#define	RISAF_REG9_CIDCFGR_WRENC1			(0x1u<<17)
#define	RISAF_REG9_CIDCFGR_WRENC0			(0x1u<<16)
#define	RISAF_REG9_CIDCFGR_RDENC7			(0x1u<<7)
#define	RISAF_REG9_CIDCFGR_RDENC6			(0x1u<<6)
#define	RISAF_REG9_CIDCFGR_RDENC5			(0x1u<<5)
#define	RISAF_REG9_CIDCFGR_RDENC4			(0x1u<<4)
#define	RISAF_REG9_CIDCFGR_RDENC3			(0x1u<<3)
#define	RISAF_REG9_CIDCFGR_RDENC2			(0x1u<<2)
#define	RISAF_REG9_CIDCFGR_RDENC1			(0x1u<<1)
#define	RISAF_REG9_CIDCFGR_RDENC0			(0x1u<<0)

#define	RISAF_REG9_CIDCFGR_WRENC7_B_0X0		(0x0u<<23)
#define	RISAF_REG9_CIDCFGR_WRENC7_B_0X1		(0x1u<<23)
#define	RISAF_REG9_CIDCFGR_WRENC6_B_0X0		(0x0u<<22)
#define	RISAF_REG9_CIDCFGR_WRENC6_B_0X1		(0x1u<<22)
#define	RISAF_REG9_CIDCFGR_WRENC5_B_0X0		(0x0u<<21)
#define	RISAF_REG9_CIDCFGR_WRENC5_B_0X1		(0x1u<<21)
#define	RISAF_REG9_CIDCFGR_WRENC4_B_0X0		(0x0u<<20)
#define	RISAF_REG9_CIDCFGR_WRENC4_B_0X1		(0x1u<<20)
#define	RISAF_REG9_CIDCFGR_WRENC3_B_0X0		(0x0u<<19)
#define	RISAF_REG9_CIDCFGR_WRENC3_B_0X1		(0x1u<<19)
#define	RISAF_REG9_CIDCFGR_WRENC2_B_0X0		(0x0u<<18)
#define	RISAF_REG9_CIDCFGR_WRENC2_B_0X1		(0x1u<<18)
#define	RISAF_REG9_CIDCFGR_WRENC1_B_0X0		(0x0u<<17)
#define	RISAF_REG9_CIDCFGR_WRENC1_B_0X1		(0x1u<<17)
#define	RISAF_REG9_CIDCFGR_WRENC0_B_0X0		(0x0u<<16)
#define	RISAF_REG9_CIDCFGR_WRENC0_B_0X1		(0x1u<<16)
#define	RISAF_REG9_CIDCFGR_RDENC7_B_0X0		(0x0u<<7)
#define	RISAF_REG9_CIDCFGR_RDENC7_B_0X1		(0x1u<<7)
#define	RISAF_REG9_CIDCFGR_RDENC6_B_0X0		(0x0u<<6)
#define	RISAF_REG9_CIDCFGR_RDENC6_B_0X1		(0x1u<<6)
#define	RISAF_REG9_CIDCFGR_RDENC5_B_0X0		(0x0u<<5)
#define	RISAF_REG9_CIDCFGR_RDENC5_B_0X1		(0x1u<<5)
#define	RISAF_REG9_CIDCFGR_RDENC4_B_0X0		(0x0u<<4)
#define	RISAF_REG9_CIDCFGR_RDENC4_B_0X1		(0x1u<<4)
#define	RISAF_REG9_CIDCFGR_RDENC3_B_0X0		(0x0u<<3)
#define	RISAF_REG9_CIDCFGR_RDENC3_B_0X1		(0x1u<<3)
#define	RISAF_REG9_CIDCFGR_RDENC2_B_0X0		(0x0u<<2)
#define	RISAF_REG9_CIDCFGR_RDENC2_B_0X1		(0x1u<<2)
#define	RISAF_REG9_CIDCFGR_RDENC1_B_0X0		(0x0u<<1)
#define	RISAF_REG9_CIDCFGR_RDENC1_B_0X1		(0x1u<<1)
#define	RISAF_REG9_CIDCFGR_RDENC0_B_0X0		(0x0u<<0)
#define	RISAF_REG9_CIDCFGR_RDENC0_B_0X1		(0x1u<<0)

// REG9_ACFGR Configuration

#define	RISAF_REG9_ACFGR_WREN				(0x1u<<13)
#define	RISAF_REG9_ACFGR_RDEN				(0x1u<<12)
#define	RISAF_REG9_ACFGR_PRIV				(0x1u<<9)
#define	RISAF_REG9_ACFGR_SEC				(0x1u<<8)
#define	RISAF_REG9_ACFGR_SRCID				(0x7u<<4)
#define	RISAF_REG9_ACFGR_SRCID_0			(0x1u<<4)
#define	RISAF_REG9_ACFGR_RLOCK				(0x1u<<1)
#define	RISAF_REG9_ACFGR_SREN				(0x1u<<0)

#define	RISAF_REG9_ACFGR_WREN_B_0X0			(0x0u<<13)
#define	RISAF_REG9_ACFGR_WREN_B_0X1			(0x1u<<13)
#define	RISAF_REG9_ACFGR_RDEN_B_0X0			(0x0u<<12)
#define	RISAF_REG9_ACFGR_RDEN_B_0X1			(0x1u<<12)
#define	RISAF_REG9_ACFGR_PRIV_B_0X0			(0x0u<<9)
#define	RISAF_REG9_ACFGR_PRIV_B_0X1			(0x1u<<9)
#define	RISAF_REG9_ACFGR_SEC_B_0X0			(0x0u<<8)
#define	RISAF_REG9_ACFGR_SEC_B_0X1			(0x1u<<8)
#define	RISAF_REG9_ACFGR_RLOCK_B_0X0		(0x0u<<1)
#define	RISAF_REG9_ACFGR_RLOCK_B_0X1		(0x1u<<1)
#define	RISAF_REG9_ACFGR_SREN_B_0X0			(0x0u<<0)
#define	RISAF_REG9_ACFGR_SREN_B_0X1			(0x1u<<0)

