hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_risaf.h
#define	RISAF_REG15_ACFGR_WREN_B_0X0		(0x0u<<13)
#define	RISAF_REG15_ACFGR_WREN_B_0X1		(0x1u<<13)
#define	RISAF_REG15_ACFGR_RDEN_B_0X0		(0x0u<<12)
#define	RISAF_REG15_ACFGR_RDEN_B_0X1		(0x1u<<12)
#define	RISAF_REG15_ACFGR_PRIV_B_0X0		(0x0u<<9)
#define	RISAF_REG15_ACFGR_PRIV_B_0X1		(0x1u<<9)
#define	RISAF_REG15_ACFGR_SEC_B_0X0			(0x0u<<8)
#define	RISAF_REG15_ACFGR_SEC_B_0X1			(0x1u<<8)
#define	RISAF_REG15_ACFGR_RLOCK_B_0X0		(0x0u<<1)
#define	RISAF_REG15_ACFGR_RLOCK_B_0X1		(0x1u<<1)
#define	RISAF_REG15_ACFGR_SREN_B_0X0		(0x0u<<0)
#define	RISAF_REG15_ACFGR_SREN_B_0X1		(0x1u<<0)

// REG15_ASTARTR Configuration

#define	RISAF_REG15_ASTARTR_SADDSTART		(0xFFFFFFFFu<<0)
#define	RISAF_REG15_ASTARTR_SADDSTART_0		(0x1u<<0)

// REG15_AENDR Configuration

#define	RISAF_REG15_AENDR_SADDEND			(0xFFFFFFFFu<<0)
#define	RISAF_REG15_AENDR_SADDEND_0			(0x1u<<0)

// REG15_ANESTR Configuration

#define	RISAF_REG15_ANESTR_DCEN				(0x1u<<2)

#define	RISAF_REG15_ANESTR_DCEN_B_0X0		(0x0u<<2)
#define	RISAF_REG15_ANESTR_DCEN_B_0X1		(0x1u<<2)

// REG15_BCFGR Configuration

#define	RISAF_REG15_BCFGR_WREN				(0x1u<<13)
#define	RISAF_REG15_BCFGR_RDEN				(0x1u<<12)
#define	RISAF_REG15_BCFGR_PRIV				(0x1u<<9)
#define	RISAF_REG15_BCFGR_SEC				(0x1u<<8)
#define	RISAF_REG15_BCFGR_SRCID				(0x7u<<4)
#define	RISAF_REG15_BCFGR_SRCID_0			(0x1u<<4)
#define	RISAF_REG15_BCFGR_RLOCK				(0x1u<<1)
#define	RISAF_REG15_BCFGR_SREN				(0x1u<<0)

#define	RISAF_REG15_BCFGR_WREN_B_0X0		(0x0u<<13)
#define	RISAF_REG15_BCFGR_WREN_B_0X1		(0x1u<<13)
#define	RISAF_REG15_BCFGR_RDEN_B_0X0		(0x0u<<12)
#define	RISAF_REG15_BCFGR_RDEN_B_0X1		(0x1u<<12)
#define	RISAF_REG15_BCFGR_PRIV_B_0X0		(0x0u<<9)
#define	RISAF_REG15_BCFGR_PRIV_B_0X1		(0x1u<<9)
#define	RISAF_REG15_BCFGR_SEC_B_0X0			(0x0u<<8)
#define	RISAF_REG15_BCFGR_SEC_B_0X1			(0x1u<<8)
#define	RISAF_REG15_BCFGR_RLOCK_B_0X0		(0x0u<<1)
#define	RISAF_REG15_BCFGR_RLOCK_B_0X1		(0x1u<<1)
#define	RISAF_REG15_BCFGR_SREN_B_0X0		(0x0u<<0)
#define	RISAF_REG15_BCFGR_SREN_B_0X1		(0x1u<<0)

// REG15_BSTARTR Configuration

#define	RISAF_REG15_BSTARTR_SADDSTART		(0xFFFFFFFFu<<0)
#define	RISAF_REG15_BSTARTR_SADDSTART_0		(0x1u<<0)

// REG15_BENDR Configuration

#define	RISAF_REG15_BENDR_SADDEND			(0xFFFFFFFFu<<0)
#define	RISAF_REG15_BENDR_SADDEND_0			(0x1u<<0)

// REG15_BNESTR Configuration

#define	RISAF_REG15_BNESTR_DCEN				(0x1u<<2)

#define	RISAF_REG15_BNESTR_DCEN_B_0X0		(0x0u<<2)
#define	RISAF_REG15_BNESTR_DCEN_B_0X1		(0x1u<<2)
